---
type: ExtensibleStorageFilter
namespace: Autodesk.Revit.DB.ExtensibleStorage
version: 2024
members: 3
tags: [revit-api, class]
---

# ExtensibleStorageFilter

`Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExtensibleStorageFilter | 2014 | `public ExtensibleStorageFilter ( Guid schemaGuid )` |
| Method | PassesFilter | — | `` |
| Property | SchemaGuid | 2014 | `public Guid SchemaGuid { get ; }` |